
/*
Красин Дима ПР-2-2 Лаб-7 Вариант 11

Task 1:

Перерахувати декілька методів класу Integer, які генерують винятки. Описати
ситуації, які призводять до наведених винятків. Класифікувати наведені винятки
на контрольовані та неконтрольовані.

Task 2:

Написати свій клас з використанням об’єкту(ів) класу Integer з обробкою
винятків (блок try-catch).


Task 3:

Для завдання з лабораторної роботи №1 (задача) потрібно:

 створити окремий клас з методом розв’язку задачі, який буде генерувати
власний (ваш) виняток;
 створити власний клас-виняток;
 в класі DemoMyException в методі main продемонструвати роботу вашого
класу з обробкою власного винятку (блок try-catch).
*/

public class Main {

    public static void main(String[] args) {

        //Task1.task1Implementation();
        Task2.task1Implementation();
        //DemoMyExceptionWithLab1New.task3Implimentation();

    }
}
